{"keras_version": "2.3.1", "class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Dense", "config": {"trainable": true, "dtype": "float32", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "dense_1", "use_bias": true, "batch_input_shape": [null, 4], "kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "units": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "dtype": "float32", "seed": null, "rate": 0.2, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"trainable": true, "dtype": "float32", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "dense_2", "use_bias": true, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "units": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "dtype": "float32", "seed": null, "rate": 0.2, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"trainable": true, "dtype": "float32", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "dense_3", "use_bias": true, "kernel_regularizer": null, "activation": "softmax", "bias_constraint": null, "units": 3, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "sequential_1"}}