{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.3.1", "config": {"layers": [{"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "batch_input_shape": [null, 30], "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "units": 16, "name": "dense_1", "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "use_bias": true}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_1", "dtype": "float32", "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "units": 16, "name": "dense_2", "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "use_bias": true}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_2", "dtype": "float32", "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "units": 1, "name": "dense_3", "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true, "use_bias": true}}], "name": "sequential_1"}}